Revit 2027 API
UnitTypeId.CelsiusInterval Property
 Celsius interval.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CelsiusInterval { get; }
Public Shared ReadOnly Property CelsiusInterval As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CelsiusInterval {
	ForgeTypeId^ get ();
}
static member CelsiusInterval : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace